stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Audio/Src/stm32_audio_dfsdm.c
/**
******************************************************************************
* @file    stm32_audio_dfsdm.c
* @author  MCD Application Team
* @brief   Manage dfsdm setup
******************************************************************************
* @attention
*
* Copyright (c) 2018(-2022) STMicroelectronics.
* All rights reserved.
*
* This software is licensed under terms that can be found in the LICENSE file
* in the root directory of this software component.
* If no LICENSE file comes with this software, it is provided AS-IS.
*
******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "stm32_audio_dfsdm.h"
#include "stm32_audio_dma.h"
/* Global variables ----------------------------------------------------------*/
/* Private defines -----------------------------------------------------------*/

#ifdef UTIL_AUDIO_DFSDM_USED
#if (USE_HAL_DFSDM_REGISTER_CALLBACKS == 1)
  #error "This driver is not ready for USE_HAL_DFSDM_REGISTER_CALLBACKS set to 1"
#endif

#ifndef UTIL_AUDIO_DFSDMx_RBS
  #error "UTIL_AUDIO_DFSDMx_RBS not defined"
  #define UTIL_AUDIO_DFSDMx_RBS 15U
#endif
/* Private macros ------------------------------------------------------------*/
#define SaturaLH(N, L, H) (((N)<(L))?(L):(((N)>(H))?(H):(N)))

/*### RECORD ###*/
#define DFSDM_OVER_SAMPLING(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (256U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (256U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (128U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (128U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (64U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (64U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (64U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K)) ? (32U) : (20U)

#define DFSDM_CLOCK_DIVIDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (24U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (4U)  \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (16U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K)) ? (16U) : (25U)

#define DFSDM_FILTER_ORDER(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (DFSDM_FILTER_SINC3_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (DFSDM_FILTER_SINC4_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (DFSDM_FILTER_SINC4_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (DFSDM_FILTER_SINC4_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (DFSDM_FILTER_SINC4_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (DFSDM_FILTER_SINC5_ORDER) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K)) ? (DFSDM_FILTER_SINC5_ORDER) : (DFSDM_FILTER_SINC5_ORDER)

/* Right Bit Shift is used to shift sample in the right dynamic as function of OVR & Filter order
*  It is used only  in case of 16-bit pcm output. These settings apply a gain and may saturate but
*  are a good compromise to handle far field application and avoid saturation is close field application.
*  Of course, very close field usage may require different setting */

#define DFSDM_MIC_RIGHT_BIT_SHIFT(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (UTIL_AUDIO_DFSDMx_RBS-6U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (UTIL_AUDIO_DFSDMx_RBS-6U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (UTIL_AUDIO_DFSDMx_RBS-2U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (UTIL_AUDIO_DFSDMx_RBS-2U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (UTIL_AUDIO_DFSDMx_RBS-6U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (UTIL_AUDIO_DFSDMx_RBS-6U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (UTIL_AUDIO_DFSDMx_RBS)    \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K)) ? (UTIL_AUDIO_DFSDMx_RBS - 5U) : (2U)

/* Left Bit Shift is used when 32-bit output is requested. the goal is to keep the
*  same gain settings that the right bit shift applies when 16-bit output is requested */

#define DFSDM_MIC_LEFT_BIT_SHIFT(__FREQUENCY__) \
        ((__FREQUENCY__) == (AUDIO_FREQUENCY_8K))  ? (9U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_11K)) ? (9U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_16K)) ? (5U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_22K)) ? (5U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_32K)) ? (9U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_44K)) ? (9U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_48K)) ? (3U) \
      : ((__FREQUENCY__) == (AUDIO_FREQUENCY_96K)) ? (8U) : (0U)

/* Private typedef -----------------------------------------------------------*/

typedef struct
{
  UTIL_AUDIO_DMA_t            hDma;
  //  DMA_HandleTypeDef           hDma;
  DFSDM_Filter_HandleTypeDef  hFilter;
  DFSDM_Channel_HandleTypeDef hChannel;
} MicContext_t;

#ifdef UTIL_AUDIO_IN_HPF_USED
typedef struct
{
  int32_t Z;
  int32_t oldOut;
  int32_t oldIn;
} HP_FilterState_TypeDef;
#endif

typedef struct
{
  UTIL_AUDIO_params_t     conf;
  MicContext_t            dfsdmMic[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] ; /* dfsdm handlers per microphone */

  #ifdef UTIL_AUDIO_IN_HPF_USED
  HP_FilterState_TypeDef  dcrem[UTIL_AUDIO_MAX_IN_CH_NB];
  #endif
  uint8_t                 lbs; /* Left bit shift for 32-bit sample gain */
} Context_t;

/* Private variables ---------------------------------------------------------*/
Context_t              G_Context;

/* Private function prototypes -----------------------------------------------*/
void UTIL_AUDIO_DFSDM_DMAx_MIC1_IRQHandler(void);
void UTIL_AUDIO_DFSDM_DMAx_MIC2_IRQHandler(void);
#if (UTIL_AUDIO_DFSDM_MIC_STARTED_NB > 2)
  void UTIL_AUDIO_DFSDM_DMAx_MIC3_IRQHandler(void);
  void UTIL_AUDIO_DFSDM_DMAx_MIC4_IRQHandler(void);
#endif

static void    s_initGpios(void);
static int32_t s_initDma(void);

static int32_t s_initOneMic(DFSDM_Filter_HandleTypeDef *hDfsdmFilter, DFSDM_Channel_HandleTypeDef *hDfsdmChannel);

/* Functions Definition ------------------------------------------------------*/
/**
* @brief  Initialize wave recording.
* @param  AudioInit Init structure
* @retval Status
*/
int32_t UTIL_AUDIO_DFSDM_Init(UTIL_AUDIO_params_t *AudioInit)
{
  uint32_t i;
  int32_t error = UTIL_AUDIO_ERROR_NONE;
  /* Save in context user config */
  memcpy(&G_Context.conf, AudioInit, sizeof(UTIL_AUDIO_params_t));


  /* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
  if (UTIL_AUDIO_DFSDM_ClockConfig(AudioInit->SampleRate) != UTIL_AUDIO_ERROR_NONE)
  {
    error = BSP_ERROR_CLOCK_FAILURE;
  }

  if (error == UTIL_AUDIO_ERROR_NONE)
  {
    error = s_initDma();
  }
  if (error == UTIL_AUDIO_ERROR_NONE)
  {
    s_initGpios();
    if (error == UTIL_AUDIO_ERROR_NONE)
    {
      for (i = 0; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i ++)
      {
        if (((AudioInit->Device >> i) & UTIL_AUDIO_DFSDMx_MIC_FIRST) == UTIL_AUDIO_DFSDMx_MIC_FIRST)
        {
          /* Default configuration of DFSDM filters and channels */
          if (s_initOneMic(&G_Context.dfsdmMic[i].hFilter, &G_Context.dfsdmMic[i].hChannel) != UTIL_AUDIO_ERROR_NONE)
          {
            /* Return BSP_ERROR_PERIPH_FAILURE when operations are not correctly done */
            error = BSP_ERROR_PERIPH_FAILURE;
          }
        }
        if (error != UTIL_AUDIO_ERROR_NONE)
        {
          break;
        }
      }
    }
  }
  if (error == UTIL_AUDIO_ERROR_NONE)
  {
    G_Context.lbs = DFSDM_MIC_LEFT_BIT_SHIFT(UTIL_AUDIO_IN_FREQUENCY);
  }
  return error;
}

/**
* @brief  Weak function for clock config (either calling existing function from BSP or write your own). It is called at init.
* @param  Sampling Frequency
* @retval Status
*/
__weak int32_t UTIL_AUDIO_DFSDM_ClockConfig(uint32_t SampleRate)
{
  return UTIL_AUDIO_ERROR_NONE;
}

/**
  * @brief  Starts audio recording with DFSDM.
  * @param  pBuf      Main buffer pointer for the recorded data storing
  * @param  NbrOfBytes Size of the recorded buffer in bytes
  * @retval status
  */
int32_t UTIL_AUDIO_DFSDM_Record(uint8_t **pBuf, uint32_t NbrOfBytes)
{
  uint16_t i;
  int32_t error = UTIL_AUDIO_ERROR_NONE;
  uint32_t mic_init[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] = {0};
  uint32_t micIdentifier = UTIL_AUDIO_DFSDMx_MIC_FIRST, pbuf_index = 0;
  uint32_t enabled_mic = 0;
  uint32_t micIdx = 0;
  /* Get the number of activated microphones */
  for (i = 0U; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i++)
  {
    if ((G_Context.conf.Device & micIdentifier) == micIdentifier)
    {
      enabled_mic++;
    }
    micIdentifier = micIdentifier << 1;
  }


  micIdentifier = UTIL_AUDIO_DFSDMx_MIC_LAST;
  UTIL_AUDIO_DISABLE_IRQ();
  for (i = 0U; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i++)
  {
    micIdx = POS_VAL(micIdentifier);
    if ((mic_init[micIdx] != 1U) && ((G_Context.conf.Device & micIdentifier) == micIdentifier))
    {
      /* Call the Media layer start function for MICx channel */
      if (HAL_DFSDM_FilterRegularStart_DMA(&G_Context.dfsdmMic[micIdx].hFilter, (int32_t *)pBuf[enabled_mic - 1U - pbuf_index], NbrOfBytes) != HAL_OK)
      {
        error = 1;
      }
      else
      {
        mic_init[micIdx] = 1;
        pbuf_index++;
      }
    }
    micIdentifier = micIdentifier >> 1;
  }
  UTIL_AUDIO_ENABLE_IRQ();

  return error;
}

/**
  * @brief  Stops audio recording with DFSDM.
  * @param  pBuf      Main buffer pointer for the recorded data storing
  * @param  NbrOfBytes Size of the recorded buffer in bytes
  * @retval status
  */
int32_t UTIL_AUDIO_DFSDM_Stop(void)
{
  uint16_t i;
  int32_t error = UTIL_AUDIO_ERROR_NONE;
  uint32_t mic_init[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] = {0};
  uint32_t micIdentifier = UTIL_AUDIO_DFSDMx_MIC_FIRST, pbuf_index = 0;
  uint32_t enabled_mic = 0;
  uint32_t micIdx = 0;
  /* Get the number of activated microphones */
  for (i = 0U; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i++)
  {
    if ((G_Context.conf.Device & micIdentifier) == micIdentifier)
    {
      enabled_mic++;
    }
    micIdentifier = micIdentifier << 1;
  }


  micIdentifier = UTIL_AUDIO_DFSDMx_MIC_LAST;
  UTIL_AUDIO_DISABLE_IRQ();
  for (i = 0U; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i++)
  {
    micIdx = POS_VAL(micIdentifier);
    if ((mic_init[micIdx] != 1U) && ((G_Context.conf.Device & micIdentifier) == micIdentifier))
    {
      /* Call the Media layer start function for MICx channel */
      if (HAL_DFSDM_FilterRegularStop_DMA(&G_Context.dfsdmMic[micIdx].hFilter) != HAL_OK)
      {
        error = 1;
      }
      else
      {
        mic_init[micIdx] = 1;
        pbuf_index++;
      }
    }
    micIdentifier = micIdentifier >> 1;
  }
  UTIL_AUDIO_ENABLE_IRQ();

  return error;
}


