stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Audio/Src/stm32_audio_dfsdm.c
void UTIL_AUDIO_DFSDM_32bitInt_process(audio_buffer_t *const pBuffInfo, int32_t **pChannelBuffer, uint32_t nbSamples, uint32_t const offsetSpleBytes)
{
  for (uint8_t idxChannel = 0U; idxChannel < UTIL_AUDIO_IN_CH_NB; idxChannel++)
  {
    uint8_t *pChBaseAddr  = (uint8_t *) pChannelBuffer[idxChannel];
    uint8_t *pInSample_u8 = pChBaseAddr + offsetSpleBytes;
    int32_t *pInSample    = (int32_t *)pInSample_u8;
    int32_t *pOutSample   = (int32_t *)AudioBuffer_getSampleAddress(pBuffInfo, idxChannel, 0U);

    #if (UTIL_AUDIO_CPU_CACHE_MAINTENANCE == 1)
    SCB_InvalidateDCache_by_Addr((void *)pInSample, nbSamples * 4UL); /* 4 because 32-bit samples*/
    #endif /* UTIL_AUDIO_CPU_CACHE_MAINTENANCE */

    for (uint32_t idxPcmBuff = 0UL; idxPcmBuff < nbSamples; idxPcmBuff++) /* half of the ping pong buffer*/
    {
      int32_t sple32                       = pInSample[idxPcmBuff] / 256;           /* 24 bits input sample stored in the MSB of a 32 bits word, div 256 removes status register info */
      #ifdef UTIL_AUDIO_IN_HPF_USED
      G_Context.dcrem[idxChannel].Z        = sple32;
      /* Formula is yn = Alpha * (yn-1 + xn - xn-1) ;
      it comes from yn = xn - dcn where dcn = alpha* dcn-1 +(1-alpha) * xn ; going to Z transform
      we get H(z) = alpha * (1-z^(-1))/(1-alpha*z^(-1) )

      H(z) =   Y(z) / X(z)
      (1-alpha* z-1 ) Y(z) =  alpha * (1 - z-1 ) X(z)
      Y(z) = alpha * Y(z) * z-1 + alpha * (X(z) - X(z) * z-1))
      ==> yn = Alpha * (yn-1 + xn - xn-1)
      */
      G_Context.dcrem[idxChannel].oldOut = (0xFC * (G_Context.dcrem[idxChannel].oldOut + G_Context.dcrem[idxChannel].Z - G_Context.dcrem[idxChannel].oldIn)) / 256;
      G_Context.dcrem[idxChannel].oldIn  = G_Context.dcrem[idxChannel].Z;
      sple32                             = G_Context.dcrem[idxChannel].oldOut;
      #endif
      pOutSample[UTIL_AUDIO_IN_CH_NB * idxPcmBuff] = sple32 << G_Context.lbs ;    /* 32 bits output samples*/ /*cstat !MISRAC2012-Rule-10.1_R6 !MISRAC2012-Rule-10.1_R7 shift on signed data is necessary for performance reason*/
    }
  }

  #if (UTIL_AUDIO_CPU_CACHE_MAINTENANCE == 1)
  SCB_CleanDCache_by_Addr((uint32_t *)AudioBuffer_getPdata(pBuffInfo), AudioBuffer_getBufferSize(pBuffInfo));
  #endif /* UTIL_AUDIO_CPU_CACHE_MAINTENANCE */

}

void UTIL_AUDIO_DFSDM_16bitInt_process(audio_buffer_t *const pBuffInfo, int32_t **pChannelBuffer, uint32_t nbSamples, uint32_t const offsetSpleBytes)
{
  for (uint8_t idxChannel = 0U; idxChannel < UTIL_AUDIO_IN_CH_NB; idxChannel++)
  {
    uint8_t *pChBaseAddr  = (uint8_t *) pChannelBuffer[idxChannel];
    uint8_t *pInSample_u8 = pChBaseAddr + offsetSpleBytes;
    int32_t *pInSample    = (int32_t *)pInSample_u8;
    int16_t *pOutSample   = (int16_t *)AudioBuffer_getSampleAddress(pBuffInfo, idxChannel, 0U);

    #if (UTIL_AUDIO_CPU_CACHE_MAINTENANCE == 1)
    SCB_InvalidateDCache_by_Addr((void *)pInSample, nbSamples * 4UL); /* 4 because 32-bit samples*/
    #endif /* UTIL_AUDIO_CPU_CACHE_MAINTENANCE */

    for (uint32_t idxPcmBuff = 0UL; idxPcmBuff < nbSamples; idxPcmBuff++) /* half of the ping pong buffer*/
    {
      int32_t sple32                     = pInSample[idxPcmBuff] / 256;           /* 24 bits input sample stored in the MSB of a 32 bits word, div 256 removes status register info */
      #ifdef UTIL_AUDIO_IN_HPF_USED
      G_Context.dcrem[idxChannel].Z      = sple32;
      /* Formula is yn = Alpha * (yn-1 + xn - xn-1) ;
      it comes from yn = xn - dcn where dcn = alpha* dcn-1 +(1-alpha) * xn ; going to Z transform
      we get H(z) = alpha * (1-z^(-1))/(1-alpha*z^(-1) )

      H(z) =   Y(z) / X(z)
      (1-alpha* z-1 ) Y(z) =  alpha * (1 - z-1 ) X(z)
      Y(z) = alpha * Y(z) * z-1 + alpha * (X(z) - X(z) * z-1))
      ==> yn = Alpha * (yn-1 + xn - xn-1)
      */
      G_Context.dcrem[idxChannel].oldOut = (0xFC * (G_Context.dcrem[idxChannel].oldOut + G_Context.dcrem[idxChannel].Z - G_Context.dcrem[idxChannel].oldIn)) / 256;
      G_Context.dcrem[idxChannel].oldIn  = G_Context.dcrem[idxChannel].Z;
      sple32                             = G_Context.dcrem[idxChannel].oldOut;
      #endif
      pOutSample[UTIL_AUDIO_IN_CH_NB * idxPcmBuff] = (int16_t)SaturaLH(sple32, -32768, 32767);    /* 16 bits output samples*/
    }
  }

  #if (UTIL_AUDIO_CPU_CACHE_MAINTENANCE == 1)
  SCB_CleanDCache_by_Addr((uint32_t *)AudioBuffer_getPdata(pBuffInfo), AudioBuffer_getBufferSize(pBuffInfo));
  #endif /* UTIL_AUDIO_CPU_CACHE_MAINTENANCE */

}

static void s_initGpios(void)
{
  GPIO_InitTypeDef  GPIO_InitStruct;
  static uint8_t gpiosInitDone = 0U;
  if (gpiosInitDone == 0U)
  {
    /* Deinit DFSDM pins configured by BSP ---------------------------------*/
    GPIO_InitStruct.Pin = UTIL_AUDIO_DFSDMx_CKOUT_PIN;
    HAL_GPIO_DeInit(UTIL_AUDIO_DFSDMx_CKOUT_GPIO_PORT, GPIO_InitStruct.Pin);

    GPIO_InitStruct.Pin = UTIL_AUDIO_DFSDMx_DATIN_MIC1_PIN;
    HAL_GPIO_DeInit(UTIL_AUDIO_DFSDMx_DATIN_MIC1_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = UTIL_AUDIO_DFSDMx_DATIN_MIC2_PIN;
    HAL_GPIO_DeInit(UTIL_AUDIO_DFSDMx_DATIN_MIC2_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = UTIL_AUDIO_DFSDMx_DATIN_MIC3_PIN;
    HAL_GPIO_DeInit(UTIL_AUDIO_DFSDMx_DATIN_MIC3_GPIO_PORT, GPIO_InitStruct.Pin);
    GPIO_InitStruct.Pin = UTIL_AUDIO_DFSDMx_DATIN_MIC4_PIN;
    HAL_GPIO_DeInit(UTIL_AUDIO_DFSDMx_DATIN_MIC4_GPIO_PORT, GPIO_InitStruct.Pin);


    /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN pins ----------------*/
    GPIO_InitStruct.Mode  = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;

    /* Enable DFSDM clock */
    UTIL_AUDIO_DFSDMx_CLK_ENABLE();

    /* Enable GPIO clock */
    UTIL_AUDIO_DFSDMx_CKOUT_GPIO_CLK_ENABLE();
    UTIL_AUDIO_DFSDMx_DATIN_MIC1_GPIO_CLK_ENABLE();
    UTIL_AUDIO_DFSDMx_DATIN_MIC2_GPIO_CLK_ENABLE();
    UTIL_AUDIO_DFSDMx_DATIN_MIC3_GPIO_CLK_ENABLE();
    UTIL_AUDIO_DFSDMx_DATIN_MIC4_GPIO_CLK_ENABLE();

    GPIO_InitStruct.Pin       = UTIL_AUDIO_DFSDMx_CKOUT_PIN;
    GPIO_InitStruct.Alternate = UTIL_AUDIO_DFSDMx_CKOUT_AF;
    HAL_GPIO_Init(UTIL_AUDIO_DFSDMx_CKOUT_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin       = UTIL_AUDIO_DFSDMx_DATIN_MIC1_PIN;
    GPIO_InitStruct.Alternate = UTIL_AUDIO_DFSDMx_DATIN_MIC1_AF;
    HAL_GPIO_Init(UTIL_AUDIO_DFSDMx_DATIN_MIC1_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin       = UTIL_AUDIO_DFSDMx_DATIN_MIC2_PIN;
    GPIO_InitStruct.Alternate = UTIL_AUDIO_DFSDMx_DATIN_MIC2_AF;
    HAL_GPIO_Init(UTIL_AUDIO_DFSDMx_DATIN_MIC2_GPIO_PORT, &GPIO_InitStruct);

