stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Audio/Src/stm32_audio_dfsdm.c
    GPIO_InitStruct.Pin       = UTIL_AUDIO_DFSDMx_DATIN_MIC3_PIN;
    GPIO_InitStruct.Alternate = UTIL_AUDIO_DFSDMx_DATIN_MIC3_AF;
    HAL_GPIO_Init(UTIL_AUDIO_DFSDMx_DATIN_MIC3_GPIO_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin       = UTIL_AUDIO_DFSDMx_DATIN_MIC4_PIN;
    GPIO_InitStruct.Alternate = UTIL_AUDIO_DFSDMx_DATIN_MIC4_AF;
    HAL_GPIO_Init(UTIL_AUDIO_DFSDMx_DATIN_MIC4_GPIO_PORT, &GPIO_InitStruct);
    gpiosInitDone++;
  }
  else
  {
    /* do nothing */
  }
}


/**
  * @brief  Initializes the DFSDM
  * @param  hDfsdmFilter  DFSDM Filter Handle
  * @param  hDfsdmChannel DFSDM Channel Handle
  * @retval status
  */
int32_t s_initOneMic(DFSDM_Filter_HandleTypeDef *hDfsdmFilter, DFSDM_Channel_HandleTypeDef *hDfsdmChannel)
{
  DFSDM_Filter_TypeDef  *dfsdmFilterInstance[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]  = {UTIL_AUDIO_DFSDMx_MIC1_FILTER, UTIL_AUDIO_DFSDMx_MIC2_FILTER, UTIL_AUDIO_DFSDMx_MIC3_FILTER, UTIL_AUDIO_DFSDMx_MIC4_FILTER};
  DFSDM_Channel_TypeDef *dfsdmChannelInstance[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] = {UTIL_AUDIO_DFSDMx_MIC1_CHANNEL, UTIL_AUDIO_DFSDMx_MIC2_CHANNEL, UTIL_AUDIO_DFSDMx_MIC3_CHANNEL, UTIL_AUDIO_DFSDMx_MIC4_CHANNEL};
  uint32_t               dfsdmDigitalMicPins[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]  = {DFSDM_CHANNEL_SAME_CHANNEL_PINS, DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS, DFSDM_CHANNEL_SAME_CHANNEL_PINS, DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS};
  uint32_t               dfsdmDigitalMicType[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]  = {DFSDM_CHANNEL_SPI_RISING, DFSDM_CHANNEL_SPI_FALLING, DFSDM_CHANNEL_SPI_RISING, DFSDM_CHANNEL_SPI_FALLING};
  uint32_t               dfsdmChannel4Filter[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]  = {UTIL_AUDIO_DFSDMx_MIC1_CHANNEL_FOR_FILTER, UTIL_AUDIO_DFSDMx_MIC2_CHANNEL_FOR_FILTER, UTIL_AUDIO_DFSDMx_MIC3_CHANNEL_FOR_FILTER, UTIL_AUDIO_DFSDMx_MIC4_CHANNEL_FOR_FILTER};

  static uint16_t micCnt = 0U;
  /* MIC filters  initialization */
  s_initGpios();

  /* Retrieve the mic index by comparing pointer of handlers */
  for (uint16_t i = 0U; i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB; i++)
  {
    if (hDfsdmFilter == &G_Context.dfsdmMic[i].hFilter)
    {
      micCnt = i;
    }
  }

  /* Test if mic index is one that should be used */
  if (((UTIL_AUDIO_IN_DEVICE_SELECT >> micCnt) & UTIL_AUDIO_DFSDMx_MIC_FIRST) == UTIL_AUDIO_DFSDMx_MIC_FIRST)
  {
    hDfsdmFilter->Instance                          = dfsdmFilterInstance[micCnt];

    hDfsdmFilter->Init.RegularParam.Trigger         = DFSDM_FILTER_SW_TRIGGER;
    /* MIC2, MIC3 and MIC4 should be synchronized to MIC1 if it's used */
    if (((UTIL_AUDIO_IN_DEVICE_SELECT & UTIL_AUDIO_DFSDMx_MIC_FIRST) == UTIL_AUDIO_DFSDMx_MIC_FIRST) && (micCnt >= 1U) && (micCnt <= 4U))
    {
      hDfsdmFilter->Init.RegularParam.Trigger       = DFSDM_FILTER_SYNC_TRIGGER;
    }
    hDfsdmFilter->Init.RegularParam.FastMode        = ENABLE;
    hDfsdmFilter->Init.RegularParam.DmaMode         = ENABLE;
    hDfsdmFilter->Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    hDfsdmFilter->Init.InjectedParam.ScanMode       = DISABLE;
    hDfsdmFilter->Init.InjectedParam.DmaMode        = DISABLE;
    hDfsdmFilter->Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
    hDfsdmFilter->Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
    hDfsdmFilter->Init.FilterParam.SincOrder        = DFSDM_FILTER_ORDER(UTIL_AUDIO_IN_FREQUENCY);
    hDfsdmFilter->Init.FilterParam.Oversampling     = DFSDM_OVER_SAMPLING(UTIL_AUDIO_IN_FREQUENCY);
    hDfsdmFilter->Init.FilterParam.IntOversampling  = 1;

    if (HAL_DFSDM_FilterInit(hDfsdmFilter) != HAL_OK)
    {
      return UTIL_AUDIO_ERROR;
    }

    /* MIC channels initialization */
    hDfsdmChannel->Instance                      = dfsdmChannelInstance[micCnt];
    hDfsdmChannel->Init.OutputClock.Activation   = ENABLE;
    hDfsdmChannel->Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
    hDfsdmChannel->Init.OutputClock.Divider      = DFSDM_CLOCK_DIVIDER(UTIL_AUDIO_IN_FREQUENCY);
    hDfsdmChannel->Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
    hDfsdmChannel->Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
    hDfsdmChannel->Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
    hDfsdmChannel->Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
    hDfsdmChannel->Init.Awd.Oversampling         = 10;
    hDfsdmChannel->Init.Offset                   = 0;
    hDfsdmChannel->Init.RightBitShift            = (UTIL_AUDIO_IN_BIT_RESOLUTION == UTIL_AUDIO_RESOLUTION_16B) ? DFSDM_MIC_RIGHT_BIT_SHIFT(UTIL_AUDIO_IN_FREQUENCY) : 0UL;
    hDfsdmChannel->Init.Input.Pins               = dfsdmDigitalMicPins[micCnt];
    hDfsdmChannel->Init.SerialInterface.Type     = dfsdmDigitalMicType[micCnt];

    if (HAL_OK != HAL_DFSDM_ChannelInit(hDfsdmChannel))
    {
      return UTIL_AUDIO_ERROR;
    }

    /* Configure injected channel */
    if (HAL_DFSDM_FilterConfigRegChannel(hDfsdmFilter, dfsdmChannel4Filter[micCnt], DFSDM_CONTINUOUS_CONV_ON) != HAL_OK)
    {
      return UTIL_AUDIO_ERROR;
    }
  }
  else
  {
    /* do nothing */
  }

  return UTIL_AUDIO_ERROR_NONE;
}

/**
  * @brief  Initialize the DFSDM filter MSP.
  * @param  hDfsdmFilter DFSDM Filter handle
  * @retval None
  */
static int32_t s_initDma(void)
{
  int32_t error = UTIL_AUDIO_ERROR_NONE;
  uint32_t i, micIdx, mic_init[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] = {0};
  IRQn_Type           dmaMic_IRQHandler[UTIL_AUDIO_DFSDM_MIC_STARTED_NB] = {UTIL_AUDIO_DFSDMx_DMAx_MIC1_IRQ, UTIL_AUDIO_DFSDMx_DMAx_MIC2_IRQ, UTIL_AUDIO_DFSDMx_DMAx_MIC3_IRQ, UTIL_AUDIO_DFSDMx_DMAx_MIC4_IRQ};
  DMA_Stream_TypeDef *dmaMic_stream[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]     = {UTIL_AUDIO_DFSDMx_DMAx_MIC1_STREAM, UTIL_AUDIO_DFSDMx_DMAx_MIC2_STREAM, UTIL_AUDIO_DFSDMx_DMAx_MIC3_STREAM, UTIL_AUDIO_DFSDMx_DMAx_MIC4_STREAM};
  uint32_t            dmaMic_Request[UTIL_AUDIO_DFSDM_MIC_STARTED_NB]    = {UTIL_AUDIO_DFSDMx_DMAx_MIC1_REQUEST, UTIL_AUDIO_DFSDMx_DMAx_MIC2_REQUEST, UTIL_AUDIO_DFSDMx_DMAx_MIC3_REQUEST, UTIL_AUDIO_DFSDMx_DMAx_MIC4_REQUEST};

