stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Utilities/Audio/Src/stm32_audio_dfsdm.c
  /* Prevent unused argument(s) compilation warning */
  /* UNUSED(hDfsdmFilter); */

  /* Enable DFSDM clock */
  UTIL_AUDIO_DFSDMx_CLK_ENABLE();

  /* Enable the DMA clock */
  UTIL_AUDIO_DFSDMx_DMAx_CLK_ENABLE();

  for (i = 0; (i < UTIL_AUDIO_DFSDM_MIC_STARTED_NB) && (error == UTIL_AUDIO_ERROR_NONE); i++)
  {
    if ((mic_init[POS_VAL(UTIL_AUDIO_DFSDMx_MIC1)] != 1U) && ((G_Context.conf.Device & UTIL_AUDIO_DFSDMx_MIC1) == UTIL_AUDIO_DFSDMx_MIC1))
    {
      micIdx = 0U;
      mic_init[micIdx] = 1;
    }
    else if ((mic_init[POS_VAL(UTIL_AUDIO_DFSDMx_MIC2)] != 1U) && ((G_Context.conf.Device & UTIL_AUDIO_DFSDMx_MIC2) == UTIL_AUDIO_DFSDMx_MIC2))
    {
      micIdx = 1U;
      mic_init[micIdx] = 1;
    }
    else if ((mic_init[POS_VAL(UTIL_AUDIO_DFSDMx_MIC3)] != 1U) && ((G_Context.conf.Device & UTIL_AUDIO_DFSDMx_MIC3) == UTIL_AUDIO_DFSDMx_MIC3))
    {
      micIdx = 2U;
      mic_init[micIdx] = 1;
    }
    else if ((mic_init[POS_VAL(UTIL_AUDIO_DFSDMx_MIC4)] != 1U) && ((G_Context.conf.Device & UTIL_AUDIO_DFSDMx_MIC4) == UTIL_AUDIO_DFSDMx_MIC4))
    {
      micIdx = 3U;
      mic_init[micIdx] = 1;
    }
    else
    {
      break;
    }
    //    /* Configure the Context.dfsdmMic.hDma[i] handle parameters */
    //    G_Context.dfsdmMic[micIdx].hDma.Init.Request             = dmaMic_Request[micIdx];
    //    G_Context.dfsdmMic[micIdx].hDma.Instance                 = dmaMic_stream[micIdx];
    //    G_Context.dfsdmMic[micIdx].hDma.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.PeriphInc           = DMA_PINC_DISABLE;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.MemInc              = DMA_MINC_ENABLE;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.Mode                = DMA_CIRCULAR;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.Priority            = DMA_PRIORITY_HIGH;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.MemBurst            = DMA_MBURST_SINGLE;
    //    G_Context.dfsdmMic[micIdx].hDma.Init.PeriphBurst         = DMA_PBURST_SINGLE;
    //    G_Context.dfsdmMic[micIdx].hDma.State                    = HAL_DMA_STATE_RESET;
    //
    //    /* Associate the DMA handle */
    //    __HAL_LINKDMA(&G_Context.dfsdmMic[micIdx].hFilter, hdmaReg, G_Context.dfsdmMic[micIdx].hDma);
    //
    //    /* Reset DMA handle state */
    //    __HAL_DMA_RESET_HANDLE_STATE(&G_Context.dfsdmMic[micIdx].hDma);
    //
    //    /* Configure the DMA Channel */
    //    (void)HAL_DMA_Init(&G_Context.dfsdmMic[micIdx].hDma);
    //
    //    /* DMA IRQ Channel configuration */
    //    HAL_NVIC_SetPriority(dmaMic_IRQHandler[micIdx], UTIL_AUDIO_DFSDMx_IT_PRIO, 0);
    //    HAL_NVIC_EnableIRQ(dmaMic_IRQHandler[micIdx]);


    G_Context.dfsdmMic[micIdx].hDma.pIpHdle         = &G_Context.dfsdmMic[micIdx].hFilter;
    G_Context.dfsdmMic[micIdx].hDma.type            = UTIL_AUDIO_DMA_IP_TYPE_DFSDM;
    G_Context.dfsdmMic[micIdx].hDma.request         = dmaMic_Request[micIdx];
    G_Context.dfsdmMic[micIdx].hDma.preemptPriority = UTIL_AUDIO_DFSDMx_IT_PRIO;
    G_Context.dfsdmMic[micIdx].hDma.pInstance       = dmaMic_stream[micIdx];
    G_Context.dfsdmMic[micIdx].hDma.irqn            = dmaMic_IRQHandler[micIdx];
    G_Context.dfsdmMic[micIdx].hDma.srcDataWidth    = DMA_PDATAALIGN_WORD;
    G_Context.dfsdmMic[micIdx].hDma.destDataWidth   = DMA_MDATAALIGN_WORD;
    G_Context.dfsdmMic[micIdx].hDma.direction       = DMA_PERIPH_TO_MEMORY;

    error = UTIL_AUDIO_DMA_Init(&G_Context.dfsdmMic[micIdx].hDma);
  }
  return error;
}


/**
  * @brief  Regular conversion complete callback.
  * @note   In interrupt mode, user has to read conversion value in this function
            using HAL_DFSDM_FilterGetRegularValue.
  * @param  hdfsdm_filter   DFSDM filter handle.
  * @retval None
  */
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  UTIL_AUDIO_CAPTURE_TxComplete_cb(UTIL_AUDIO_CAPTURE_getHalfBuffOffsetBytes(), 2);
}

/**
  * @brief  Half regular conversion complete callback.
  * @param  hdfsdm_filter   DFSDM filter handle.
  * @retval None
  */

void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{
  UTIL_AUDIO_CAPTURE_TxComplete_cb(0UL, 2);
}

/**
* @brief This function handles DMA MIC1 interrupt request.
* @param None
* @retval None
*/
void UTIL_AUDIO_DFSDM_DMAx_MIC1_IRQHandler(void)
{
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Start();
  HAL_DMA_IRQHandler(G_Context.dfsdmMic[POS_VAL(UTIL_AUDIO_DFSDMx_MIC1)].hFilter.hdmaReg);
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Stop();
}

/**
* @brief This function handles DMA MIC2 interrupt request.
* @param None
* @retval None
*/
void UTIL_AUDIO_DFSDM_DMAx_MIC2_IRQHandler(void)
{
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Start();
  HAL_DMA_IRQHandler(G_Context.dfsdmMic[POS_VAL(UTIL_AUDIO_DFSDMx_MIC2)].hFilter.hdmaReg);
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Stop();
}

#if (UTIL_AUDIO_DFSDM_MIC_STARTED_NB > 2)
/**
* @brief This function handles DMA MIC3 interrupt request.
* @param None
* @retval None
*/
void UTIL_AUDIO_DFSDM_DMAx_MIC3_IRQHandler(void)
{
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Start();
  HAL_DMA_IRQHandler(G_Context.dfsdmMic[POS_VAL(UTIL_AUDIO_DFSDMx_MIC3)].hFilter.hdmaReg);
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Stop();
}

/**
* @brief This function handles DMA MIC4 interrupt request.
* @param None
* @retval None
*/
void UTIL_AUDIO_DFSDM_DMAx_MIC4_IRQHandler(void)
{
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Start();
  HAL_DMA_IRQHandler(G_Context.dfsdmMic[POS_VAL(UTIL_AUDIO_DFSDMx_MIC4)].hFilter.hdmaReg);
  UTIL_AUDIO_INOUT_IRQ_cycleMeasure_Stop();
}
#endif

#endif // USE_DFSDM
